package View;

import java.util.ArrayList;

public class PlayData {
	private ArrayList<String> dayGraphic;
	private ArrayList<String> goodList;
	private ArrayList<String> badList;
	private ArrayList<String> title;
	private ArrayList<String> quiz;
	private ArrayList<String> qAnswer;
	
	protected PlayData() {
		dayGraphic = new ArrayList<>();
		
		
		dayGraphic.add(" ____            ____              \r\n"
				+ "|  _ \\          |  _ \\  __ _ _   _ \r\n"
				+ "| | | |  _____  | | | |/ _` | | | |\r\n"
				+ "| |_| | |_____| | |_| | (_| | |_| |\r\n"
				+ "|____/          |____/ \\__,_|\\__, |\r\n"
				+ "                             |___/ ");
		
		dayGraphic.add(" ____            _ \r\n"
				+ "|  _ \\          / |\r\n"
				+ "| | | |  _____  | |\r\n"
				+ "| |_| | |_____| | |\r\n"
				+ "|____/          |_|");

		dayGraphic.add(" ____            ____  \r\n"
				+ "|  _ \\          |___ \\ \r\n"
				+ "| | | |  _____    __) |\r\n"
				+ "| |_| | |_____|  / __/ \r\n"
				+ "|____/          |_____|");

		dayGraphic.add(" ____            _____ \r\n"
				+ "|  _ \\          |___ / \r\n"
				+ "| | | |  _____    |_ \\ \r\n"
				+ "| |_| | |_____|  ___) |\r\n"
				+ "|____/          |____/ ");		
		
		dayGraphic.add(" ____            _  _   \r\n"
				+ "|  _ \\          | || |  \r\n"
				+ "| | | |  _____  | || |_ \r\n"
				+ "| |_| | |_____| |__   _|\r\n"
				+ "|____/             |_|  ");

		dayGraphic.add(" ____            ____  \r\n"
				+ "|  _ \\          | ___| \r\n"
				+ "| | | |  _____  |___ \\ \r\n"
				+ "| |_| | |_____|  ___) |\r\n"
				+ "|____/          |____/ ");
	
		dayGraphic.add(" ____             __   \r\n"
				+ "|  _ \\           / /_  \r\n"
				+ "| | | |  _____  | '_ \\ \r\n"
				+ "| |_| | |_____| | (_) |\r\n"
				+ "|____/           \\___/ ");
		
		dayGraphic.add(" ____            _____ \r\n"
				+ "|  _ \\          |___  |\r\n"
				+ "| | | |  _____     / / \r\n"
				+ "| |_| | |_____|   / /  \r\n"
				+ "|____/           /_/   ");	
		
		dayGraphic.add(" ____             ___  \r\n"
				+ "|  _ \\           ( _ ) \r\n"
				+ "| | | |  _____   / _ \\ \r\n"
				+ "| |_| | |_____| | (_) |\r\n"
				+ "|____/           \\___/ ");		
		dayGraphic.add(" ____             ___  \r\n"
				+ "|  _ \\           / _ \\ \r\n"
				+ "| | | |  _____  | (_) |\r\n"
				+ "| |_| | |_____|  \\__, |\r\n"
				+ "|____/             /_/ ");

		dayGraphic.add(" ____            _  ___  \r\n"
				+ "|  _ \\          / |/ _ \\ \r\n"
				+ "| | | |  _____  | | | | |\r\n"
				+ "| |_| | |_____| | | |_| |\r\n"
				+ "|____/          |_|\\___/ ");
		dayGraphic.add(" ____            _ _ \r\n"
				+ "|  _ \\          / / |\r\n"
				+ "| | | |  _____  | | |\r\n"
				+ "| |_| | |_____| | | |\r\n"
				+ "|____/          |_|_|");
		dayGraphic.add(" ____            _ ____  \r\n"
				+ "|  _ \\          / |___ \\ \r\n"
				+ "| | | |  _____  | | __) |\r\n"
				+ "| |_| | |_____| | |/ __/ \r\n"
				+ "|____/          |_|_____|");
		dayGraphic.add(" ____            _ _____ \r\n"
				+ "|  _ \\          / |___ / \r\n"
				+ "| | | |  _____  | | |_ \\ \r\n"
				+ "| |_| | |_____| | |___) |\r\n"
				+ "|____/          |_|____/ ");
			dayGraphic.add(" ____            _ _  _   \r\n"
				+ "|  _ \\          / | || |  \r\n"
				+ "| | | |  _____  | | || |_ \r\n"
				+ "| |_| | |_____| | |__   _|\r\n"
				+ "|____/          |_|  |_|  ");

		dayGraphic.add(" ____            _ ____  \r\n"
				+ "|  _ \\          / | ___| \r\n"
				+ "| | | |  _____  | |___ \\ \r\n"
				+ "| |_| | |_____| | |___) |\r\n"
				+ "|____/          |_|____/ ");
		
		dayGraphic.add(" ____            _  __   \r\n"
				+ "|  _ \\          / |/ /_  \r\n"
				+ "| | | |  _____  | | '_ \\ \r\n"
				+ "| |_| | |_____| | | (_) |\r\n"
				+ "|____/          |_|\\___/ ");
			
		dayGraphic.add(" ____            _ _____ \r\n"
				+ "|  _ \\          / |___  |\r\n"
				+ "| | | |  _____  | |  / / \r\n"
				+ "| |_| | |_____| | | / /  \r\n"
				+ "|____/          |_|/_/   ");
		
		dayGraphic.add(" ____            _  ___  \r\n"
				+ "|  _ \\          / |( _ ) \r\n"
				+ "| | | |  _____  | |/ _ \\ \r\n"
				+ "| |_| | |_____| | | (_) |\r\n"
				+ "|____/          |_|\\___/ ");
		
		dayGraphic.add(" ____            _  ___  \r\n"
				+ "|  _ \\          / |/ _ \\ \r\n"
				+ "| | | |  _____  | | (_) |\r\n"
				+ "| |_| | |_____| | |\\__, |\r\n"
				+ "|____/          |_|  /_/ ");

		dayGraphic.add(" ____            ____   ___  \r\n"
				+ "|  _ \\          |___ \\ / _ \\ \r\n"
				+ "| | | |  _____    __) | | | |\r\n"
				+ "| |_| | |_____|  / __/| |_| |\r\n"
				+ "|____/          |_____|\\___/ ");
		






		
		goodList = new ArrayList<>();
		goodList.add("럭키! 상사가 길에서 5만원을 주웠습니다.");
		goodList.add("팀원과 함께 산 로또에 상사만 당첨! 10만원을 획득하였습니다.");
		goodList.add("상사가 미팅에 성공해 기분이 좋습니다.");
		goodList.add("건물 전기공사로 정전이 되었으나 파일을 날리지 않았습니다.");
		goodList.add("귀여운 강아지와 산책으로 힐링!");
		goodList.add("인센티브를 받아 팀원들과 함께 단합의 시간을 보냈습니다!");
		goodList.add("출근길에 귀여운 고양이를 만나서 기분이 좋습니다!");

		badList = new ArrayList<>();
		badList.add("화창한 아침이지만, 상사의 기분이 좋지 않습니다.");
		badList.add("갑자기 내린 소나기로 인해 전기가 나가 작업하던 파일을 날렸습니다.");
		badList.add("상사가 교통사고로 차가 고장이 나서 현재 기분이 나쁩니다.");
		badList.add("지하철 공사로 길이 막혀 지각을 한 상사가 기분이 좋지 않습니다.");
		badList.add("지진으로 인한 피해로 주식이 떨어진 상사가 기분이 안 좋습니다.");
		badList.add("진행되던 프로젝트에 보고서가 누락되었습니다!");
		badList.add("팀원과의 불화로 사무실 분위기가 싸늘해졌습니다.");
		
		title = new ArrayList<>();
		title.add("☆☆■■■■■☆☆■■☆☆■■■■■■☆☆■■☆☆☆☆☆■■■■☆☆☆☆☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆■■☆■☆☆☆■☆☆☆■☆■■☆■☆☆☆■■■■■☆☆■■");
		title.add("☆■■■■■■☆☆■■☆☆■■☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆■■■■■■☆☆■■☆☆■■■■■☆■■☆■☆☆☆■☆☆☆■☆■■☆■☆☆■■■■■■☆☆■■");
		title.add("☆■■☆☆☆■■☆■■☆☆■■☆☆☆☆☆☆■■☆☆■■■■■■■■■■☆☆☆☆☆☆☆■■☆☆■■☆☆☆☆☆■■☆■■☆■☆☆☆■■■■■☆■■☆■☆☆■■☆☆☆■■☆■■");
		title.add("☆■■☆☆☆■■☆■■☆☆■■■■■■■■■■☆☆☆■■■■■■■■☆☆☆☆☆☆☆■■■☆☆■■☆☆☆☆☆■■☆■■☆■☆☆☆■☆☆☆■■■■☆■☆☆■■☆☆☆■■■■■");
		title.add("☆■■☆☆☆■■☆■■☆☆■■☆■☆☆☆☆■■☆☆☆■■■■■■■■☆☆☆☆☆☆☆■■☆☆☆■■☆☆■■■■■☆■■☆■☆☆☆■☆☆■■☆■■☆■☆☆■■■■■■■☆■■");
		title.add("☆■■■■■■☆☆■■☆☆■■☆☆☆☆☆☆■■☆☆☆☆■■■■■■■☆☆☆☆☆☆■■■☆☆☆■■■■■☆☆☆■■■■☆■☆☆☆■■■■■☆■■☆■☆☆☆■■■■■☆☆■■");
		title.add("☆☆■■■■■☆☆■■☆☆■■■■■■■☆■■☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆■■■■■☆☆■■☆■■☆☆☆☆☆■■☆■☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆");
		title.add("☆☆☆☆☆☆☆☆☆■■☆☆☆☆■☆☆☆☆☆■■☆■■■■■■■■■■■■☆■■■■☆■■■☆■■☆■■☆☆☆☆☆■■☆■☆☆☆☆☆■■■■■■■■☆☆☆☆■☆☆☆☆☆☆■■");
		title.add("☆☆☆■■☆☆☆☆■■☆☆☆☆■■☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆■■■☆☆☆■■☆■■☆☆■■■■■■■■☆■☆☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆■☆☆☆☆☆☆■■" );
		title.add("☆☆☆■■☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆■■☆☆■■☆■☆☆☆☆☆■■■■■■■■☆☆☆☆■■■■■■■■■");
		title.add("☆☆☆■■☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆■■☆■☆☆☆☆☆■☆☆☆☆☆☆☆☆☆☆☆■☆☆☆☆☆☆■■");
		title.add("☆☆☆■■■■■■■■☆☆☆☆■■■■■■■■☆☆☆■■■■■■■■■☆☆☆☆☆☆☆☆☆☆☆■■☆☆☆☆☆☆☆☆■■☆■☆☆☆☆☆■■■■■■■■■☆☆☆■■■■■■■■■");
	
		quiz = new ArrayList<>();
		quiz.add("곰이 물구나무를 서면?");
		quiz.add("가장 뜨거운 과일은?");
		quiz.add("호랑이가 차에 태워주면서 하는 말은?");
		quiz.add("인내력이 부족한 삼각김밥은?");
		quiz.add("구명보트에 몇 명 탈 수 있을까?");
		// 여기 데이터 넣는 거,,, helpp!!
		
		qAnswer = new ArrayList<>();
		qAnswer.add("문");
		qAnswer.add("천도 복숭아");
		qAnswer.add("타 이거");
		qAnswer.add("참치마요");
		qAnswer.add("9명");
		// 여기도 데이터 넣는 거,,, help!!
		
	}

	public ArrayList<String> getDayGraphic() {
		return dayGraphic;
	}

	public ArrayList<String> getGoodList() {
		return goodList;
	}

	public ArrayList<String> getBadList() {
		return badList;
	}
	
	public ArrayList<String> getTitle() {
		return title;
	}
	
	public ArrayList<String> getQuiz() {
		return quiz;
	}
	
	public ArrayList<String> getqAnswer() {
		return qAnswer;
	}
	
}
